MicrochipTech/dspic33a-high-speed-adc-example/cli.c
    console_kv("[sweep] halves per point", halves);
    console_puts("[sweep] idle = CPU polls RAM only, process = main-loop processing, sfr = CPU polls an SFR\r\n"
                 "[sweep] overrun must be 0 for a usable rate; late/missed are from the process run\r\n"
                 "[sweep] measured = samples per second seen by the DMA (Timer1), reg = SAMC read back\r\n");

    /* Time base check: 100 ms of CPU time (200 MHz) must be 1 250 000
     * ticks. Anything else and the measured rates are off by the same
     * factor - and the assumption about the timer's clock is wrong. */
    sweep_timer_init();
    {
        const uint32_t t0 = TMR1;
        __delay32(20000000ul);
        console_kv("[sweep] timer check, ticks per 100 ms (expect 1250000)", TMR1 - t0);
    }
    for (uint32_t i = 0; i < sizeof samcs / sizeof samcs[0]; i++) {
        console_puts("[sweep] ");
        sweep_row(samcs[i], halves);
    }

    (void)capture_set_input(capture_pinsel(), keep_samc);
    counters_clear();
    if (was_running) { capture_start(); }
    console_puts("[sweep] done: counters cleared, previous samc and run state restored\r\n");
}

static void cmd_sweep_fn(int argc, char **argv)
{
    uint32_t halves = SWEEP_HALVES_DEFAULT;
    if ((argc > 2) || ((argc == 2) && !arg_u32(argv[1], 10u, 100000u, &halves))) {
        usage("sweep [halves per point 10..100000, default 2000]");
        return;
    }
    console_sweep(halves);
}
CMD_DEFINE(sweep, "sweep", cmd_sweep_fn, "sweep [halves] - overrun vs sample rate, 1.25..40 MSPS");

static void cmd_reset_fn(int argc, char **argv)
{
    (void)argc; (void)argv;
    put_line("resetting");
    console_drain();                    /* let the reply leave first */
    __asm__ volatile ("reset");
}
CMD_DEFINE(reset, "reset", cmd_reset_fn, "reset - software reset");

/* ------------------------------------------------------------------ */
void cli_init(void)
{
    /* The clocks have changed under the baud generator: re-set it for
     * the 100 MHz peripheral clock, after the last FRC-timed byte is out.
     * Only when the divider really changes: in the simulator build the
     * CPU never leaves the FRC, and toggling ON while the simulator's
     * UART model is still transmitting leaves its transmitter dead
     * (TXWRE set, nothing gets out any more). */
    if (U2BRG != UART_BRG_PLL) {
        console_drain();
        uart2_setup(UART_BRG_PLL);
        console_puts("[boot] uart reclocked to PLL2, 115200 8N1\r\n");
    }

    cmd_parser_init(console_write);
    cmd_parser_set_yield(console_yield);     /* after init - init clears it */
    (void)cmd_register(&cmd_version);
    (void)cmd_register(&cmd_status);
    (void)cmd_register(&cmd_regs);
    (void)cmd_register(&cmd_start);
    (void)cmd_register(&cmd_stop);
    (void)cmd_register(&cmd_samc);
    (void)cmd_register(&cmd_input);
    (void)cmd_register(&cmd_selftest);
    (void)cmd_register(&cmd_stats);
    (void)cmd_register(&cmd_dump);
    (void)cmd_register(&cmd_clear);
    (void)cmd_register(&cmd_led);
    (void)cmd_register(&cmd_sweep);
    (void)cmd_register(&cmd_reset);

    /* Banner, once at start-up. A human sees what is talking and which
     * build it is; a script simply reads on until the readiness byte that
     * follows the first prompt. */
    console_puts("\r\n"
                 "adc_dma_40msps - ADC at 40 MSPS into RAM via DMA\r\n"
                 SIM_BANNER_NOTE           /* empty on silicon            */
                 "board: EV74H48A, dsPIC33AK512MPS512 GP DIM\r\n"
                 "build: " __DATE__ " " __TIME__ "\r\n"
                 "type 'help' for the commands\r\n"
                 "please log this terminal from power-up and send it back\r\n");

    /* Receive interrupt: IRQ 102, IEC3/IFS3 bit 6, priority in IPC12.
     * Enabled last, so that nothing typed early runs a command before
     * the measurement is set up. */
    IPC12bits.U2RXIP = UART_RX_PRIORITY;
    IFS3bits.U2RXIF  = 0u;
    IEC3bits.U2RXIE  = 1u;

    cmd_parser_prompt();                     /* sync point for a reader */
}
